app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(id: "DESC")
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC

  def create
    post = Post.create(content: params[:content], checked: false)
---
INSERT INTO `posts` (`content`, `checked`, `created_at`, `updated_at`) VALUES ('実は私・・・宇宙人です。', FALSE, '2020-07-28 07:07:20.083213', '2020-07-28 07:07:20.083213')

  def checked
    post = Post.find(params[:id])
    if post.checked then
      post.update(checked: false)
    else
      post.update(checked: true)
    end

    item = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `posts`.`checked` = FALSE, `posts`.`updated_at` = '2020-07-28 06:27:04.668371' WHERE `posts`.`id` = 2
UPDATE `posts` SET `posts`.`checked` = TRUE, `posts`.`updated_at` = '2020-07-28 06:27:06.491317' WHERE `posts`.`id` = 1